TrangLu1999/STM32-Sidewalk-SDK-main/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_app_radio_lora.c
    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa symbol timeout. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)num_of_symbols;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_modulation_params(const sid_pal_radio_lora_modulation_params_t * mod_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t                                        err               = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t                         hal_err;
    const halo_drv_stm32wlxx_ctx_t * const         drv_ctx           = stm32wlxx_radio_get_drv_ctx_ctx();
    sid_pal_radio_lora_modulation_params_t * const active_mod_params = (sid_pal_radio_lora_modulation_params_t *)&drv_ctx->applied_lora_phy_cfg.lora_modulation_params;

    do
    {
        /* Note: always send out modulation parameters even if there are no changes to keep Rx/Tx setup timings consistent */
        stm32wlxx_radio_lora_phy_mod_params_t hal_mod_params = {
            .bandwidth        = mod_params->bandwidth,
            .coding_rate      = mod_params->coding_rate,
            .spreading_factor = mod_params->spreading_factor,
        };

        hal_err = stm32wlxx_hal_set_lora_modulation_params(drv_ctx, &hal_mod_params);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy((void *)active_mod_params, mod_params, sizeof(*active_mod_params));
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa modulation params. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)mod_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_packet_params(const sid_pal_radio_lora_packet_params_t * packet_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t                                    err               = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t                     hal_err;
    const halo_drv_stm32wlxx_ctx_t * const     drv_ctx           = stm32wlxx_radio_get_drv_ctx_ctx();
    sid_pal_radio_lora_packet_params_t * const active_pkt_params = (sid_pal_radio_lora_packet_params_t *)&drv_ctx->applied_lora_phy_cfg.lora_packet_params;

    do
    {
        /* Note: always send out packet parameters even if there are no changes to keep Rx/Tx setup timings consistent */
        stm32wlxx_radio_lora_phy_pkt_params_t hal_pkt_params = {
            .crc_mode        = packet_params->crc_mode,
            .header_type     = packet_params->header_type,
            .invert_IQ       = packet_params->invert_IQ,
            .payload_length  = packet_params->payload_length,
            .preamble_length = packet_params->preamble_length,
        };

        hal_err = stm32wlxx_hal_radio_set_lora_pkt_params(drv_ctx, hal_pkt_params);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy((void *)active_pkt_params, packet_params, sizeof(*active_pkt_params));
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa packet params. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)packet_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_cad_params(const sid_pal_radio_lora_cad_params_t *cad_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t err;
    stm32wlxx_hal_status_t hal_err;
    halo_drv_stm32wlxx_ctx_t * const drv_ctx = (halo_drv_stm32wlxx_ctx_t *)stm32wlxx_radio_get_drv_ctx_ctx();

    do
    {
        static_assert(SID_PAL_RADIO_LORA_CAD_EXIT_MODE_CAD_ONLY == STM32WLxx_RADIO_CAD_EXIT_MODE_CS_ONLY);
        static_assert(SID_PAL_RADIO_LORA_CAD_EXIT_MODE_CAD_RX   == STM32WLxx_RADIO_CAD_EXIT_MODE_CS_RX);
        static_assert(SID_PAL_RADIO_LORA_CAD_EXIT_MODE_CAD_LBT  == STM32WLxx_RADIO_CAD_EXIT_MODE_CS_LBT);
        if ((cad_params->cad_exit_mode != SID_PAL_RADIO_LORA_CAD_EXIT_MODE_CAD_ONLY)
         && (cad_params->cad_exit_mode != SID_PAL_RADIO_LORA_CAD_EXIT_MODE_CAD_RX)
         && (cad_params->cad_exit_mode != SID_PAL_RADIO_LORA_CAD_EXIT_MODE_CAD_LBT))
        {
            /* Not a known CAD mode */
            err = RADIO_ERROR_NOT_SUPPORTED;
            break;
        }
        drv_ctx->cad_exit_mode = cad_params->cad_exit_mode;

        if (SID_STM32_UTIL_fast_memcmp(&drv_ctx->applied_lora_phy_cfg.lora_cad_params, cad_params, sizeof(drv_ctx->applied_lora_phy_cfg.lora_cad_params)) == 0u)
        {
            /* No change in CAD parameters, skipping the send out */
            err = RADIO_ERROR_NONE;
            break;
        }

        /* Send out new LoRa CAD parameters */
        hal_err = stm32wlxx_hal_radio_set_lora_cad_params(drv_ctx, cad_params);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            /* Logs are provided by stm32wlxx_hal_radio_set_lora_cad_params() */
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Store the new parameters */
        SID_STM32_UTIL_fast_memcpy(&drv_ctx->applied_lora_phy_cfg.lora_cad_params, cad_params, sizeof(drv_ctx->applied_lora_phy_cfg.lora_cad_params));

        err = RADIO_ERROR_NONE;
    } while (0);

    return err;
#else
    (void)cad_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

